### Task 3: Column Selection and Indexing

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/student.csv")

In [3]:
display(df["Marks"])

0    78
1    34
2    56
3    89
4    42
5    91
Name: Marks, dtype: int64

In [5]:
display(df[["Name", "Marks"]])

     Name  Marks
0    Amit     78
1    Neha     34
2    Ravi     56
3   Pooja     89
4   Karan     42
5  Anjali     91

In [6]:
display(df.loc[0:2, ["Name", "Marks"]])

   Name  Marks
0  Amit     78
1  Neha     34
2  Ravi     56